perf/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: WarmUp
      duration: 30
      arrivalRate: 5
    - name: RampUp
      duration: 30
      arrivalRate: 5
      rampTo: 5
    - name: Plain
      duration: 120
      arrivalRate: 30
    - name: CleanUp
      duration: 15
      arrivalRate: 0
    

scenarios:
  - name: Ping (/ping)
    flow:
      - get:
          url: '/ping'