perf/spaceflight.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 20
      arrivalRate: 1
      rampTo: 20
    - name: Plain
      duration: 10
      arrivalRate: 2
    - name: Plain2
      duration: 10
      arrivalRate: 10
    

scenarios:
  - name: Spaceflight (/spaceflight_news)
    flow:
      - get:
          url: '/spaceflight_news'